<template>
  <div class="row">
      <div class='white-box'>
                    <div class="head line">
                        <div class='lay'>ID</div>
                        <div class='lay'>PUBLISHER</div>
                        <div class='lay'>DATE</div>
                        <div class='lay'>E-MAIL</div>
                        <div class='lay'>IP</div>
                        <div class='lay'>USER-ID</div>
                        <div class='lay'>STATE</div>
                    </div>
                    <div class='info line'>
                        <div class='lay'>7015</div>
                        <div class='lay'><div class='av'></div>Victor Chehov</div>
                        <div class='lay'>24.00.15 at 15:25:35</div>
                        <div class='lay'>victor@gmail.com</div>
                        <div class='lay'>177.234.55.23</div>
                        <div class='lay'>foi23mio4j2m3oi4j3523o </div>
                        <div class='lay'>PUBLISHED
                            <button type="button" class="btn btn-info btn-outline btn-circle btn-s m-r-14"><i class="ti-check"></i></button>
                            <button type="button" class="btn btn-info btn-outline btn-circle btn-s m-r-14"><i class="ti-trash"></i></button>
                        </div>


                    </div>
                    <div class='comment line'>
                        <i class="fa fa-thumbs-up"/>
                          <div style="height:80px;" class='lay comment-area'>вовремя ◆ Мы с женою предпочли видеть «Альзиру» и приехали в театр очень кстати. Д. И. Фонвизин, «К родным», 1777–1778 г. (цитата из Национального корпуса русского языка, см. Список литературы) ◆ Хлестаков. Сделайте милость, Артемий Филипович, со мной странный случай: в дороге совершенно издержался. Нет ли у вас денег взаймы рублей четыреста? Артемий Филипович. Есть. Хлестаков. Скажите, как кстати. Покорнейше вас благодарю. Н. В. Гоголь, «Ревизор», 1836 г.
в нужный, удобный, подходящий момент; к месту, уместно ◆ Иногда находила на него неодолимая охота потешить присутствующих русскими песнями, даже пляской, и тогда он пускался во все нелёгкие, кстати ли, некстати — ему всё одно. В. И. Даль, «Вакх Сидоров Чайкин, или Рассказ его о собственном своём житье-бытье, за первую половину жизни своей», 1843 г. (цитата из Национального корпуса русского языка, см. Список литературы) ◆  — Я про эти балки так только вспомнил, что вот по случаю купить можно дёшево, думал, вам на постройку кстати. С. Н. Сергеев-Ценский, «Движения», 1909–1910 г. (цитата из Национального корпуса русского языка, см. Список литературы)
устар. прилично, пристойно ◆ Отсутствует пример употребления (см. рекомендации).
пользуясь случаем, заодно, вместе с тем ◆ Зайдёмте кстати на почту; ко мне должны быть письма из полка… А. Ф. Вельтман, «Эротида», 1835 г. (цитата из Национального корпуса русского языка, см. Список литературы) ◆ А в начале февраля заехал к нему в гости Подчекаев и кстати привёз ему повестку. С. Н. Сергеев-Ценский, «Движения», 1909–1910 г. (цитата из Национального корпуса русского языка, см. Список литературы)
в знач. вводн. сл., обычно в сочетании с глаг. сказать: употребляется для обозначения того, что данная фраза говорится в связи с только что сказанным, в дополнение к нему ◆ Кстати о слоге, до́лжно ли в сём случае сказать — не мог ему того простить — или не мог ему то простить? А. С. Пушкин, «О русской прозе», 1822 г. (цитата из Национального корпуса русского языка, см. Список литературы) ◆ Кстати: начал я писать с 13-летнего возраста и печатать почти с того же времени. А. С. Пушкин, «Записные книжки», 1815–1836 г. (цитата из Национального корпуса русского языка, см. Список литературы)</div>
                        <div @click="heigh($event)" class='lay btn btn-info btn-outline btn-rectangle btn-s m-r-20'>{{showHide}}</div>


                    </div>
                    </div>
                </div>
</template>

<script>
    export default {
      
      data(){
        return{
          like:'mdi-thumb-up',
          dislike:'mdi-thumb-down',
          height:'80px',
          showHide:'Show',
          lists:[
            {reaction:"1",time:"24.06.2018 13:44",user:"Sergey12[id:422] serg@gmail.com 194.22.42.122 ",comment:"Nuxt.js — это высокоуровневый фреймворк, построенный на экосистеме Vue, что обеспечит быстрое получение опыта разработки универсальных приложений на Vue. И даже лучше, вы можете использовать его в качестве генератора статических сайтов (со страницами представленными однофайловыми компонентами)! Мы настоятельно рекомендуем попробовать его.",date:"27.06.2018",published:true},
            {reaction:"0",time:"24.06.2018 13:44",user:"Sergey12[id:422] serg@gmail.com 194.22.42.122 ",comment:"Nuxt.js — это высокоуровневый фреймворк, построенный на экосистеме Vue, что обеспечит быстрое получение опыта разработки универсальных приложений на Vue. И даже лучше, вы можете использовать его в качестве генератора статических сайтов (со страницами представленными однофайловыми компонентами)! Мы настоятельно рекомендуем попробовать его.",date:"27.06.2018",published:false},
            {reaction:"1",time:"24.06.2018 13:44",user:"Sergey12[id:422] serg@gmail.com 194.22.42.122 ",comment:"Nuxt.js — это высокоуровневый фреймворк, построенный на экосистеме Vue, что обеспечит быстрое получение опыта разработки универсальных приложений на Vue. И даже лучше, вы можете использовать его в качестве генератора статических сайтов (со страницами представленными однофайловыми компонентами)! Мы настоятельно рекомендуем попробовать его.",date:"27.06.2018",published:false},
            {reaction:"0",time:"24.06.2018 13:44",user:"Sergey12[id:422] serg@gmail.com 194.22.42.122 ",comment:"Nuxt.js — это высокоуровневый фреймворк, построенный на экосистеме Vue, что обеспечит быстрое получение опыта разработки универсальных приложений на Vue. И даже лучше, вы можете использовать его в качестве генератора статических сайтов (со страницами представленными однофайловыми компонентами)! Мы настоятельно рекомендуем попробовать его.",date:"27.06.2018",published:true},
            {reaction:"1",time:"24.06.2018 13:44",user:"Sergey12[id:422] serg@gmail.com 194.22.42.122 ",comment:"Nuxt.js — это высокоуровневый фреймворк, построенный на экосистеме Vue, что обеспечит быстрое получение опыта разработки универсальных приложений на Vue. И даже лучше, вы можете использовать его в качестве генератора статических сайтов (со страницами представленными однофайловыми компонентами)! Мы настоятельно рекомендуем попробовать его.",date:"27.06.2018",published:true},

          ]


        }

      },
      methods:{
          heigh(e){
              this.$rest.api('getStatisticClient').then(res=>{console.log(res)})
             if( e.target.previousSibling.style.height=='80px')
             {
                 e.target.previousSibling.style.height='auto'
                 this.showHide = 'Hide'
                 }
             else{
                 e.target.previousSibling.style.height='80px';
                this.showHide = 'Show'
             }
          }
      }
    }
</script>

<style scoped>
.line {
    display: flex;
    flex-direction: row;
    width: 100%;
    justify-content: space-between;
    border-bottom: 1px solid rgba(245,245,245);
    padding:5px;
    margin-top:10px;
    color:#666;
}
.info{
    border-bottom:none;
}
.lay:not(.comment){
    width: 20%;
}
.info .lay{
        display: flex;
    flex-direction:row;
    align-items: center;
}
.av {
    width: 30px;
    height: 30px;  
    background: silver;
    border-radius: 100%; 
    margin-right: 5px;
}
.comment {
    background:rgba(252, 252, 252, 1);
    overflow: hidden;
    align-items: flex-end;
    padding: 15px;
}
.lay:first-child{
    width: 5%;
}
.line .btn {
    margin-left: 3px; 
}
.comment .btn{
    height: 30px;
} 
.comment i {
    font-size:25px;
    color:#DDD;
}
.line .comment-area{
        border-radius: 5px;
    padding: 15px;
    height: 20px;
    width: 90%;
    
}





</style>
