export default {
    "create": {
        "newContact": "Новый контакт",
        "imageContact": "Иконка контакта",
        "helpImage": "Иконка контакта должно быть не менние 100 x 100пх, Формат:PNG,JPG",
        "nameSystem": "Имя системы контакт",
        "enterSystem": "Введите систему",
        "value": "Контактые данны",
        "enterValue": "Введите контакт",
        "link": "Ссылка контакта",
        "enterLink": "Введите ссылку",
        "sizeBlock":"Размер блока (из 100%)",
        "helpText":"Для того чтобы отредактировать контак, просто нажмите на текст который нужно измеить",
        "btnAddContact":"Создать контакт"
    }
}